Tekla.Structures.Drawing.Automation.DrawingCreator.CreateDrawings(Tekla.Structures.Drawing.Automation.AutoDrawingRule,System.Collections.Generic.List{Tekla.Structures.Identifier},Tekla.Structures.Drawing.Automation.AutoDrawingsStatusEnum@)
Creates drawings using the AutoDrawing tool of Tekla Structures.
Rule: The AutoDrawing rule to be used.
aModelObjectIdentifier: The model object identifier list to be used.
OperationStatus: The operation status to be used.
Returns: True on success.

Tekla.Structures.Drawing.Automation.DrawingCreator.CreateDrawings(Tekla.Structures.Drawing.Automation.AutoDrawingRule,Tekla.Structures.Identifier,Tekla.Structures.Drawing.Automation.AutoDrawingsStatusEnum@)
Creates drawings using the AutoDrawing tool of Tekla Structures.
Rule: The AutoDrawing rule to be used.
ModelObjectIdentifier: The model object identifier to be used.
OperationStatus: The operation status to be used.
Returns: True on success.

Tekla.Structures.Drawing.Automation.DrawingCreator.CreateDrawings(Tekla.Structures.Drawing.Automation.AutoDrawingRule,Tekla.Structures.Identifier)
Creates drawings using the AutoDrawing tool of Tekla Structures.
Rule: The AutoDrawing rule to be used.
ModelObjectIdentifier: The model object identifier to be used.
Returns: True on success.